'''
# Программа запрашивает у пользователя строку чисел, разделённых пробелом. 
# При нажатии Enter должна выводиться сумма чисел. 
# Пользователь может продолжить ввод чисел, разделённых пробелом и снова нажать Enter. 
# Сумма вновь введённых чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается. 
# Если специальный символ введён после нескольких чисел, 
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.
# 
# Task 5.
'''
def foo():
    pass

my_list = []
summ_list = []
b = 0
# while 
# try:
    
# except ValueError:
    # print("Введен некорректный символ.")
    # break


# Получаем числа и добавляем их в один список
print("Введите числа разделенные пробелом: ")
a = input()

print(a.split())
print(type(a))
print(a)
my_list = list(a)
print(type(a))
print(a)
# for i in a:
    

